{
    "Projects": [
        {
            "Project": "MergeScript Express",
            "id": "merge",
            "Description": "MergeScript Express is designed to streamline the process of generating JavaScript code compatible with the SheetJS package, focusing particularly on merging cells functionality. With our intuitive interface, users can effortlessly create the necessary code snippets tailored to their merging requirements, saving time and ensuring compatibility with SheetJS. MergeScript Express simplifies the task of incorporating merging cells functionality into your projects.",
            "icons": [
                {
                    "name": "React",
                    "url": "reactIconImg"
                },
                {
                    "name": "Typescript",
                    "url": "typescriptIconImg"
                }
            ],
            "images": [
                "mergescript_vid"
            ],
            "github": "https://github.com/S-Chiaravanont/XLSX_Formatter_React",
            "liveLink": "https://s-chiaravanont.github.io/XLSX_Formatter_React/"
        },
        {
            "Project": "Mileage Dashboard",
            "id": "mileage",
            "Description": "I developed a sleek mileage dashboard web app as part of my portfolio, leveraging React and TypeScript along with Material UI for a modern user interface. The app features intuitive gauge statistics, informative graphs, and a detailed history table to track mileage data effortlessly. Additionally, it includes a sample mileage form for seamless data input and management.",
            "icons": [
                {
                    "name": "React",
                    "url": "reactIconImg"
                },
                {
                    "name": "Typescript",
                    "url": "typescriptIconImg"
                }
            ],
            "images": [
                "dashboard_vid"
            ],
            "github": "https://github.com/S-Chiaravanont/dashboard_mileage",
            "liveLink": "https://S-Chiaravanont.github.io/dashboard_mileage/#/mileage"
        },
        {
            "Project": "Translator Text Chrome Extension",
            "id": "translator",
            "Description": "A simple Chrome extension that let user translate selected text to a pre-selected language through Google Translate. The main reason for this project is to learn how to build my own Chrome Extension and use/read Chrome API.",
            "icons": [
                {
                    "name": "HTML",
                    "url": "html5IconImg"
                },
                {
                    "name": "JavaScript",
                    "url": "javascriptIconImg"
                }
            ],
            "images": [
                "translator"
            ],
            "github": "https://github.com/S-Chiaravanont/translate_text_chrome_extension",
            "liveLink": ""
        },
        {
            "Project": "In the pipeline...",
            "id": "pipeline",
            "Description": "> RESTful API - A headless RESTful application focusing on FIFA World Cup 1930-2022 Data and Statistics \n > Web Application (educational site for basic formwork engineering) - Discover key concepts and techniques through interactive features where users can manipulate virtual formwork configurations, gaining hands-on experience in formwork design and construction methods. \n > A product landing page focusing on ThreeJS library. Using react-three-fiber and react-three-drei libraries to bring product to life with custom animation and camera control.",
            "icons": [
                {
                    "name": "NodeJS",
                    "url": "nodejsIconImg"
                },
                {
                    "name": "ExpressJS",
                    "url": "expressjsIconImg"
                },
                {
                    "name": "React",
                    "url": "reactIconImg"
                },
                {
                    "name": "Typescript",
                    "url": "typescriptIconImg"
                },
                {
                    "name": "CSS3",
                    "url": "css3IconImg"
                }
            ],
            "images": [
                "coding"
            ],
            "github": "https://github.com/S-Chiaravanont/",
            "liveLink": ""
        }
    ]
}