{
    "Projects": [
        {
            "Project": "Zesty Pan",
            "id": "zesty",
            "Description": "Zesty Pan is a website where food lovers can explore, learn and rate dishes around the globe. Through our platform, we aim to celebrate the diversity of cuisines and encourage everyone to explore, rate, and appreciate the unique flavors that the world has to offer.",
            "icons": [
                {
                    "name": "Vue 3",
                    "url": "vueIconImg"
                },
                {
                    "name": "NodeJS",
                    "url": "nodejsIconImg"
                },
                {
                    "name": "ExpressJS",
                    "url": "expressjsIconImg"
                },
                {
                    "name": "MySQL",
                    "url": "mysqlIconImg"
                }
            ],
            "images": [
                "zesty_vid"
            ],
            "github": "",
            "liveLink": "https://zestypan.com"
        },
        {
            "Project": "Real time spreadsheet",
            "id": "rtsheet",
            "Description": "A real time spreadsheet with directory navigation similar to Google Drive format. The app utilize websocket to create individual 'sheet/room' connection so that there are no cross connection between sheets and only users that are within the same sheet will get the update. The app also connects to MySQL database so that all data will be persisted as well as table meta data like column/row and its position. Really cool thing about this table is that it is built on top of tanstack table which is feature rich including filter, sort, CRUD operation to column, row and cell, drag and drop column/row, and pagination.",
            "icons": [
                {
                    "name": "React",
                    "url": "reactIconImg"
                },
                {
                    "name": "NodeJS",
                    "url": "nodejsIconImg"
                },
                {
                    "name": "ExpressJS",
                    "url": "expressjsIconImg"
                },
                {
                    "name": "MySQL",
                    "url": "mysqlIconImg"
                }
            ],
            "images": [
                "rtsheet_vid"
            ],
            "github": "https://github.com/S-Chiaravanont/real-time-spreadsheet",
            "liveLink": "http://sheet.siriphumchiaravanont.com"
        },
        {
            "Project": "MergeScript Express",
            "id": "merge",
            "Description": "MergeScript Express is designed to streamline the process of generating JavaScript code compatible with the SheetJS package, focusing particularly on merging cells functionality. With our intuitive interface, users can effortlessly create the necessary code snippets tailored to their merging requirements, saving time and ensuring compatibility with SheetJS. MergeScript Express simplifies the task of incorporating merging cells functionality into your projects.",
            "icons": [
                {
                    "name": "React",
                    "url": "reactIconImg"
                },
                {
                    "name": "Typescript",
                    "url": "typescriptIconImg"
                }
            ],
            "images": [
                "mergescript_vid"
            ],
            "github": "https://github.com/S-Chiaravanont/XLSX_Formatter_React",
            "liveLink": "http://xlsx.siriphumchiaravanont.com"
        },
        {
            "Project": "Mileage Dashboard",
            "id": "mileage",
            "Description": "I developed a sleek mileage dashboard web app as part of my portfolio, leveraging React and TypeScript along with Material UI for a modern user interface. The app features intuitive gauge statistics, informative graphs, and a detailed history table to track mileage data effortlessly. Additionally, it includes a sample mileage form for seamless data input and management.",
            "icons": [
                {
                    "name": "React",
                    "url": "reactIconImg"
                },
                {
                    "name": "Typescript",
                    "url": "typescriptIconImg"
                }
            ],
            "images": [
                "dashboard_vid"
            ],
            "github": "https://github.com/S-Chiaravanont/dashboard_mileage",
            "liveLink": "http://dashboard.siriphumchiaravanont.com/#/mileage"
        },
        {
            "Project": "Translator Text Chrome Extension",
            "id": "translator",
            "Description": "A simple Chrome extension that let user translate selected text to a pre-selected language through Google Translate. The main reason for this project is to learn how to build my own Chrome Extension and use/read Chrome API.",
            "icons": [
                {
                    "name": "HTML",
                    "url": "html5IconImg"
                },
                {
                    "name": "JavaScript",
                    "url": "javascriptIconImg"
                }
            ],
            "images": [
                "translator"
            ],
            "github": "https://github.com/S-Chiaravanont/translate_text_chrome_extension",
            "liveLink": ""
        },
        {
            "Project": "In the pipeline...",
            "id": "pipeline",
            "Description": "> Improving user experience and continue adding more dishes for Zesty Pan. Planning to add mini games to make the website more interactive. \n > Web Application (educational site for basic formwork engineering) - Discover key concepts and techniques through interactive features where users can manipulate virtual formwork configurations, gaining hands-on experience in formwork design and construction methods. \n > A product landing page focusing on ThreeJS library. Using react-three-fiber and react-three-drei libraries to bring product to life with custom animation and camera control.",
            "icons": [
                {
                    "name": "NodeJS",
                    "url": "nodejsIconImg"
                },
                {
                    "name": "ExpressJS",
                    "url": "expressjsIconImg"
                },
                {
                    "name": "React",
                    "url": "reactIconImg"
                },
                {
                    "name": "Typescript",
                    "url": "typescriptIconImg"
                },
                {
                    "name": "Vue 3",
                    "url": "vueIconImg"
                }
            ],
            "images": [
                "coding"
            ],
            "github": "https://github.com/S-Chiaravanont/",
            "liveLink": ""
        }
    ]
}